Add Architecture diagram
